// 1. Using .call -------------------------------------------------------------
function showFullName() {
    alert( this.firstName + " " + this.lastName );
}

var user = {
    firstName: "Василий",
    lastName: "Петров"
};

// функция вызовется с this=user
showFullName.call(user) // "Василий Петров"

var user2 = {
    firstName: "Василий",
    surname: "Петров",
    patronym: "Иванович"
};

function showFullName2(firstPart, lastPart) {
    alert( this[firstPart] + " " + this[lastPart] );
}

// f.call(контекст, аргумент1, аргумент2, ...)
showFullName2.call(user2, 'firstName', 'surname') // "Василий Петров"
showFullName2.call(user2, 'firstName', 'patronym') // "Василий Иванович"

/*

Для добавления/удаления элементов:
push (...items) – добавляет элементы в конец,
pop() – извлекает элемент с конца,
shift() – извлекает элемент с начала,
unshift(...items) – добавляет элементы в начало.
splice(pos, deleteCount, ...items) – начиная с индекса pos, удаляет deleteCount элементов и вставляет items.
slice(start, end) – создаёт новый массив, копируя в него элементы с позиции start до end (не включая end).
concat(...items) – возвращает новый массив: копирует все члены текущего массива и добавляет к нему items. Если какой-то из items является массивом, тогда берутся его элементы.

Для поиска среди элементов:
indexOf/lastIndexOf(item, pos) – ищет item, начиная с позиции pos, и возвращает его индекс или -1, если ничего не найдено.
includes(value) – возвращает true, если в массиве имеется элемент value, в противном случае false.
find/filter(func) – фильтрует элементы через функцию и отдаёт первое/все значения, при прохождении которых через функцию возвращается true.
findIndex похож на find, но возвращает индекс вместо значения.

Для перебора элементов:
forEach(func) – вызывает func для каждого элемента. Ничего не возвращает.

Для преобразования массива:
map(func) – создаёт новый массив из результатов вызова func для каждого элемента.
sort(func) – сортирует массив «на месте», а потом возвращает его.
reverse() – «на месте» меняет порядок следования элементов на противоположный и возвращает изменённый массив.
split/join – преобразует строку в массив и обратно.
reduce(func, initial) – вычисляет одно значение на основе всего массива, вызывая func для каждого элемента и передавая промежуточный результат между вызовами.

18. Деструктуризация позволяет разбивать объект или массив на переменные при присвоении.
*/
